Revit 2027 API
DuctSizes.GetDuctSizeIterator Method
Returns a DuctSizeIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctSizeIterator GetDuctSizeIterator()
Public Function GetDuctSizeIterator As DuctSizeIterator
public:
DuctSizeIterator^ GetDuctSizeIterator()
member GetDuctSizeIterator : unit -> DuctSizeIterator
Return Value
DuctSizeIterator
A DuctSizeIterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace